In [40]:
import pandas as pd

In [41]:
df = pd.read_csv('Training Data.csv')

In [42]:
df.shape

(252000, 13)

In [43]:
df.head()

,Id,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS,Risk_Flag
0,1,1303834,23,3,single,rented,no,Mechanical_engineer,Rewa,Madhya_Pradesh,3,13,0
1,2,7574516,40,10,single,rented,no,Software_Developer,Parbhani,Maharashtra,9,13,0
2,3,3991815,66,4,married,rented,no,Technical_writer,Alappuzha,Kerala,4,10,0
3,4,6256451,41,2,single,rented,yes,Software_Developer,Bhubaneswar,Odisha,2,12,1
4,5,5768871,47,11,single,rented,no,Civil_servant,Tiruchirappalli[10],Tamil_Nadu,3,14,1

In [44]:
df= df.drop(columns=['Id'],axis=1)

In [45]:
df.head()

,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS,Risk_Flag
0,1303834,23,3,single,rented,no,Mechanical_engineer,Rewa,Madhya_Pradesh,3,13,0
1,7574516,40,10,single,rented,no,Software_Developer,Parbhani,Maharashtra,9,13,0
2,3991815,66,4,married,rented,no,Technical_writer,Alappuzha,Kerala,4,10,0
3,6256451,41,2,single,rented,yes,Software_Developer,Bhubaneswar,Odisha,2,12,1
4,5768871,47,11,single,rented,no,Civil_servant,Tiruchirappalli[10],Tamil_Nadu,3,14,1

In [46]:
df.isnull().sum()

Income               0
Age                  0
Experience           0
Married/Single       0
House_Ownership      0
Car_Ownership        0
Profession           0
CITY                 0
STATE                0
CURRENT_JOB_YRS      0
CURRENT_HOUSE_YRS    0
Risk_Flag            0
dtype: int64

In [47]:
df['Married/Single'].unique()

array(['single', 'married'], dtype=object)

In [48]:
df['House_Ownership'].unique()

array(['rented', 'norent_noown', 'owned'], dtype=object)

In [49]:
df['Car_Ownership'].unique()

array(['no', 'yes'], dtype=object)

In [50]:
p=df['Profession'].unique()

In [51]:
len(p)

51

In [52]:
p

array(['Mechanical_engineer', 'Software_Developer', 'Technical_writer',
       'Civil_servant', 'Librarian', 'Economist', 'Flight_attendant',
       'Architect', 'Designer', 'Physician', 'Financial_Analyst',
       'Air_traffic_controller', 'Politician', 'Police_officer', 'Artist',
       'Surveyor', 'Design_Engineer', 'Chemical_engineer',
       'Hotel_Manager', 'Dentist', 'Comedian', 'Biomedical_Engineer',
       'Graphic_Designer', 'Computer_hardware_engineer',
       'Petroleum_Engineer', 'Secretary', 'Computer_operator',
       'Chartered_Accountant', 'Technician', 'Microbiologist',
       'Fashion_Designer', 'Aviator', 'Psychologist', 'Magistrate',
       'Lawyer', 'Firefighter', 'Engineer', 'Official', 'Analyst',
       'Geologist', 'Drafter', 'Statistician', 'Web_designer',
       'Consultant', 'Chef', 'Army_officer', 'Surgeon', 'Scientist',
       'Civil_engineer', 'Industrial_Engineer', 'Technology_specialist'],
      dtype=object)

In [53]:
df['CITY'].unique()

array(['Rewa', 'Parbhani', 'Alappuzha', 'Bhubaneswar',
       'Tiruchirappalli[10]', 'Jalgaon', 'Tiruppur', 'Jamnagar',
       'Kota[6]', 'Karimnagar', 'Hajipur[31]', 'Adoni', 'Erode[17]',
       'Kollam', 'Madurai', 'Anantapuram[24]', 'Kamarhati', 'Bhusawal',
       'Sirsa', 'Amaravati', 'Secunderabad', 'Ahmedabad', 'Ajmer',
       'Ongole', 'Miryalaguda', 'Ambattur', 'Indore', 'Pondicherry',
       'Shimoga', 'Chennai', 'Gulbarga', 'Khammam', 'Saharanpur',
       'Gopalpur', 'Amravati', 'Udupi', 'Howrah', 'Aurangabad[39]',
       'Hospet', 'Shimla', 'Khandwa', 'Bidhannagar', 'Bellary', 'Danapur',
       'Purnia[26]', 'Bijapur', 'Patiala', 'Malda', 'Sagar', 'Durgapur',
       'Junagadh', 'Singrauli', 'Agartala', 'Thanjavur', 'Hindupur',
       'Naihati', 'North_Dumdum', 'Panchkula', 'Anantapur', 'Serampore',
       'Bathinda', 'Nadiad', 'Kanpur', 'Haridwar', 'Berhampur',
       'Jamshedpur', 'Hyderabad', 'Bidar', 'Kottayam', 'Solapur',
       'Suryapet', 'Aizawl', 'Asansol', 'Deoghar', 'Eluru[25]',
       'Ulhasnagar', 'Aligarh', 'South_Dumdum', 'Berhampore',
       'Gandhinagar', 'Sonipat', 'Muzaffarpur', 'Raichur',
       'Rajpur_Sonarpur', 'Ambarnath', 'Katihar', 'Kozhikode', 'Vellore',
       'Malegaon', 'Kochi', 'Nagaon', 'Nagpur', 'Srinagar', 'Davanagere',
       'Bhagalpur', 'Siwan[32]', 'Meerut', 'Dindigul', 'Bhatpara',
       'Ghaziabad', 'Kulti', 'Chapra', 'Dibrugarh', 'Panihati',
       'Bhiwandi', 'Morbi', 'Kalyan-Dombivli', 'Gorakhpur', 'Panvel',
       'Siliguri', 'Bongaigaon', 'Patna', 'Ramgarh', 'Ozhukarai',
       'Mirzapur', 'Akola', 'Satna', 'Motihari[34]', 'Jalna', 'Jalandhar',
       'Unnao', 'Karnal', 'Cuttack', 'Proddatur', 'Ichalkaranji',
       'Warangal[11][12]', 'Jhansi', 'Bulandshahr', 'Narasaraopet',
       'Chinsurah', 'Jehanabad[38]', 'Dhanbad', 'Gudivada', 'Gandhidham',
       'Raiganj', 'Kishanganj[35]', 'Varanasi', 'Belgaum',
       'Tirupati[21][22]', 'Tumkur', 'Coimbatore', 'Kurnool[18]',
       'Gurgaon', 'Muzaffarnagar', 'Aurangabad', 'Bhavnagar', 'Arrah',
       'Munger', 'Tirunelveli', 'Mumbai', 'Mango', 'Nashik', 'Kadapa[23]',
       'Amritsar', 'Khora,_Ghaziabad', 'Ambala', 'Agra', 'Ratlam',
       'Surendranagar_Dudhrej', 'Delhi_city', 'Bhopal', 'Hapur', 'Rohtak',
       'Durg', 'Korba', 'Bangalore', 'Shivpuri', 'Thrissur',
       'Vijayanagaram', 'Farrukhabad', 'Nangloi_Jat', 'Madanapalle',
       'Thoothukudi', 'Nagercoil', 'Gaya', 'Chandigarh_city', 'Jammu[16]',
       'Kakinada', 'Dewas', 'Bhalswa_Jahangir_Pur', 'Baranagar',
       'Firozabad', 'Phusro', 'Allahabad', 'Guna', 'Thane', 'Etawah',
       'Vasai-Virar', 'Pallavaram', 'Morena', 'Ballia', 'Surat',
       'Burhanpur', 'Phagwara', 'Mau', 'Mangalore', 'Alwar',
       'Mahbubnagar', 'Maheshtala', 'Hazaribagh', 'Bihar_Sharif',
       'Faridabad', 'Lucknow', 'Tenali', 'Barasat', 'Amroha', 'Giridih',
       'Begusarai', 'Medininagar', 'Rajahmundry[19][20]', 'Saharsa[29]',
       'New_Delhi', 'Bhilai', 'Moradabad', 'Machilipatnam',
       'Mira-Bhayandar', 'Pali', 'Navi_Mumbai', 'Mehsana', 'Imphal',
       'Kolkata', 'Sambalpur', 'Ujjain', 'Madhyamgram', 'Jabalpur',
       'Jamalpur[36]', 'Ludhiana', 'Bareilly', 'Gangtok', 'Anand',
       'Dehradun', 'Pune', 'Satara', 'Srikakulam', 'Raipur', 'Jodhpur',
       'Darbhanga', 'Nizamabad', 'Nandyal', 'Dehri[30]', 'Jorhat',
       'Ranchi', 'Kumbakonam', 'Guntakal', 'Haldia', 'Loni',
       'Pimpri-Chinchwad', 'Rajkot', 'Nanded', 'Noida',
       'Kirari_Suleman_Nagar', 'Jaunpur', 'Bilaspur', 'Sambhal', 'Dhule',
       'Rourkela', 'Thiruvananthapuram', 'Dharmavaram', 'Nellore[14][15]',
       'Visakhapatnam[4]', 'Karawal_Nagar', 'Jaipur', 'Avadi',
       'Bhimavaram', 'Bardhaman', 'Silchar', 'Buxar[37]', 'Kavali',
       'Tezpur', 'Ramagundam[27]', 'Yamunanagar', 'Sri_Ganganagar',
       'Sasaram[30]', 'Sikar', 'Bally', 'Bhiwani', 'Rampur', 'Uluberia',
       'Sangli-Miraj_&_Kupwad', 'Hosur', 'Bikaner', 'Shahjahanpur',
       'Sultan_Pur_Majra', 'Vijayawada', 'Bharatpur', 'Tadepalligudem',
       'Tinsukia', 'Salem', 'Mathura', 'Guntur[13]', 'Hubliâ€“Dharwad',
       'Guwahati', 'Chittoor[28]', 'Tiruvottiyur', 'Vadodara',
       'Ahmednagar', 'Fatehpur', 'Bhilwara', 'Kharagpur', 'Bettiah[33]',
       'Bhind', 'Bokaro', 'Karaikudi', 'Raebareli', 'Pudukkottai',
       'Udaipur', 'Mysore[7][8][9]', 'Panipat', 'Latur', 'Tadipatri',
       'Bahraich', 'Orai', 'Raurkela_Industrial_Township', 'Gwalior',
       'Katni', 'Chandrapur', 'Kolhapur'], dtype=object)

In [54]:
len(df['CITY'].unique())

317

In [55]:
df['STATE'].unique()

array(['Madhya_Pradesh', 'Maharashtra', 'Kerala', 'Odisha', 'Tamil_Nadu',
       'Gujarat', 'Rajasthan', 'Telangana', 'Bihar', 'Andhra_Pradesh',
       'West_Bengal', 'Haryana', 'Puducherry', 'Karnataka',
       'Uttar_Pradesh', 'Himachal_Pradesh', 'Punjab', 'Tripura',
       'Uttarakhand', 'Jharkhand', 'Mizoram', 'Assam',
       'Jammu_and_Kashmir', 'Delhi', 'Chhattisgarh', 'Chandigarh',
       'Uttar_Pradesh[5]', 'Manipur', 'Sikkim'], dtype=object)

In [56]:
len(df['STATE'].unique())

29

In [57]:
cat=['Married/Single','House_Ownership','Car_Ownership','Profession','CITY','STATE']

#### label encoder

In [58]:
from sklearn.preprocessing import OrdinalEncoder

mar_sin=OrdinalEncoder(handle_unknown='use_encoded_value',unknown_value=-1)
house_own=OrdinalEncoder(handle_unknown='use_encoded_value',unknown_value=-1)
car_own=OrdinalEncoder(handle_unknown='use_encoded_value',unknown_value=-1)
prof=OrdinalEncoder(handle_unknown='use_encoded_value',unknown_value=-1)
city=OrdinalEncoder(handle_unknown='use_encoded_value',unknown_value=-1)
state=OrdinalEncoder(handle_unknown='use_encoded_value',unknown_value=-1)

In [59]:
df.columns

Index(['Income', 'Age', 'Experience', 'Married/Single', 'House_Ownership',
       'Car_Ownership', 'Profession', 'CITY', 'STATE', 'CURRENT_JOB_YRS',
       'CURRENT_HOUSE_YRS', 'Risk_Flag'],
      dtype='object')

for i in cat:
    df[i] = label.fit_transform(df[i])

In [60]:
import numpy as np

mar_sin.fit(np.array(df['Married/Single']).reshape(-1,1))
house_own.fit(np.array(df['House_Ownership']).reshape(-1,1))
car_own.fit(np.array(df['Car_Ownership']).reshape(-1,1))
prof.fit(np.array(df['Profession']).reshape(-1,1))
city.fit(np.array(df['CITY']).reshape(-1,1))
state.fit(np.array(df['STATE']).reshape(-1,1))

df['Married/Single']=mar_sin.transform(np.array(df['Married/Single']).reshape(-1,1))
df['House_Ownership']=house_own.transform(np.array(df['House_Ownership']).reshape(-1,1))
df['Car_Ownership']=car_own.transform(np.array(df['Car_Ownership']).reshape(-1,1))
df['Profession']=prof.transform(np.array(df['Profession']).reshape(-1,1))
df['CITY']=city.transform(np.array(df['CITY']).reshape(-1,1))
df['STATE']=state.transform(np.array(df['STATE']).reshape(-1,1))

In [61]:
df.head()

,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS,Risk_Flag
0,1303834,23,3,1.0,2.0,0.0,33.0,251.0,13.0,3,13,0
1,7574516,40,10,1.0,2.0,0.0,43.0,227.0,14.0,9,13,0
2,3991815,66,4,0.0,2.0,0.0,47.0,8.0,12.0,4,10,0
3,6256451,41,2,1.0,2.0,1.0,43.0,54.0,17.0,2,12,1
4,5768871,47,11,1.0,2.0,0.0,11.0,296.0,22.0,3,14,1

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252000 entries, 0 to 251999
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Income             252000 non-null  int64
 1   Age                252000 non-null  int64
 2   Experience         252000 non-null  int64
 3   Married/Single     252000 non-null  float64
 4   House_Ownership    252000 non-null  float64
 5   Car_Ownership      252000 non-null  float64
 6   Profession         252000 non-null  float64
 7   CITY               252000 non-null  float64
 8   STATE              252000 non-null  float64
 9   CURRENT_JOB_YRS    252000 non-null  int64
 10  CURRENT_HOUSE_YRS  252000 non-null  int64
 11  Risk_Flag          252000 non-null  int64
dtypes: float64(6), int64(6)
memory usage: 23.1 MB

In [63]:
df['CITY'] = df['CITY'].astype('str')

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252000 entries, 0 to 251999
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Income             252000 non-null  int64
 1   Age                252000 non-null  int64
 2   Experience         252000 non-null  int64
 3   Married/Single     252000 non-null  float64
 4   House_Ownership    252000 non-null  float64
 5   Car_Ownership      252000 non-null  float64
 6   Profession         252000 non-null  float64
 7   CITY               252000 non-null  object
 8   STATE              252000 non-null  float64
 9   CURRENT_JOB_YRS    252000 non-null  int64
 10  CURRENT_HOUSE_YRS  252000 non-null  int64
 11  Risk_Flag          252000 non-null  int64
dtypes: float64(5), int64(6), object(1)
memory usage: 23.1+ MB

In [65]:
df.head()

,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS,Risk_Flag
0,1303834,23,3,1.0,2.0,0.0,33.0,251.0,13.0,3,13,0
1,7574516,40,10,1.0,2.0,0.0,43.0,227.0,14.0,9,13,0
2,3991815,66,4,0.0,2.0,0.0,47.0,8.0,12.0,4,10,0
3,6256451,41,2,1.0,2.0,1.0,43.0,54.0,17.0,2,12,1
4,5768871,47,11,1.0,2.0,0.0,11.0,296.0,22.0,3,14,1

In [66]:
df['CITY'] = df['CITY'].astype('float')

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252000 entries, 0 to 251999
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Income             252000 non-null  int64
 1   Age                252000 non-null  int64
 2   Experience         252000 non-null  int64
 3   Married/Single     252000 non-null  float64
 4   House_Ownership    252000 non-null  float64
 5   Car_Ownership      252000 non-null  float64
 6   Profession         252000 non-null  float64
 7   CITY               252000 non-null  float64
 8   STATE              252000 non-null  float64
 9   CURRENT_JOB_YRS    252000 non-null  int64
 10  CURRENT_HOUSE_YRS  252000 non-null  int64
 11  Risk_Flag          252000 non-null  int64
dtypes: float64(6), int64(6)
memory usage: 23.1 MB

#### ml model

In [68]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

In [69]:
X= df.drop(columns=['Risk_Flag'],axis=1)
y= df[['Risk_Flag']]

In [70]:
X.head()

,Income,Age,Experience,Married/Single,House_Ownership,Car_Ownership,Profession,CITY,STATE,CURRENT_JOB_YRS,CURRENT_HOUSE_YRS
0,1303834,23,3,1.0,2.0,0.0,33.0,251.0,13.0,3,13
1,7574516,40,10,1.0,2.0,0.0,43.0,227.0,14.0,9,13
2,3991815,66,4,0.0,2.0,0.0,47.0,8.0,12.0,4,10
3,6256451,41,2,1.0,2.0,1.0,43.0,54.0,17.0,2,12
4,5768871,47,11,1.0,2.0,0.0,11.0,296.0,22.0,3,14

In [71]:
y.head()

   Risk_Flag
0          0
1          0
2          0
3          1
4          1

In [72]:
X_train,X_val,y_train,y_val=train_test_split(X,y)

In [73]:
y_train.head()

        Risk_Flag
206309          0
57190           0
179730          0
126142          0
126791          0

In [74]:
rf=RandomForestClassifier()

In [75]:
rf.fit(X_train,y_train)

C:\Users\saina\AppData\Local\Temp/ipykernel_4072/1593328843.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf.fit(X_train,y_train)

RandomForestClassifier()

In [76]:
pred=rf.predict(X_val)

In [77]:
from sklearn.metrics import accuracy_score

accuracy_score(pred,y_val)

0.8989206349206349

In [78]:
import pickle

filename = 'Loan_Prediction.sav'
pickle.dump(rf, open(filename, 'wb'))

pickle.dump(mar_sin, open('mar_sin.sav', 'wb'))
pickle.dump(house_own, open('house_own.sav', 'wb'))
pickle.dump(car_own, open('car_own.sav', 'wb'))
pickle.dump(prof, open('prof.sav', 'wb'))
pickle.dump(city, open('city.sav', 'wb'))
pickle.dump(state, open('state.sav', 'wb'))